tap "elixir-tools/tap"
tap "homebrew/bundle"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line tools for fly.io services
brew "flyctl"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
cask "font-fira-code-nerd-font"
cask "font-victor-mono-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Replacement for Docker Desktop
cask "orbstack"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
vscode "1yib.rust-bundle"
vscode "akamud.vscode-theme-onelight"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fehey.brackets-light-pro"
vscode "formulahendry.code-runner"
vscode "fosshaas.fontsize-shortcuts"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "theholycoder.swagger-tools"
vscode "thomaspink.theme-github"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
