tap "homebrew/bundle"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
cask "font-fira-code-nerd-font"
cask "font-victor-mono-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
vscode "1yib.rust-bundle"
vscode "akamud.vscode-theme-onelight"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fehey.brackets-light-pro"
vscode "formulahendry.code-runner"
vscode "fosshaas.fontsize-shortcuts"
vscode "foxundermoon.next-js"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "loilo.snazzy-light"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "theholycoder.swagger-tools"
vscode "thomaspink.theme-github"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
